_posts/2021-10-17-boj-13913.html
---
layout: post
title: BOJ 13913 숨바꼭질 4
tags: STL BFS
---

<div id="outline-container-org220349e" class="outline-2">
<h2 id="org220349e">BOJ 13913 숨바꼭질 4</h2>
</div>

<div id="outline-container-org682e4dd" class="outline-2">
<h2 id="org682e4dd">접근하기</h2>
<div class="outline-text-2" id="text-org682e4dd">
<ul class="org-ul">
<li>BFS 순서로 점을 이동하여, 목표 위치에 제일먼저 닿으면, 최단거리</li>
<li>1, -1 이동은 왔다갔다를 무한반복할 수 있음. visit배열로 중복 처리를 제외함</li>
<li>path출력은 stack에 역순으로 출력</li>
</ul>
</div>
</div>

<div id="outline-container-org4d271f4" class="outline-2">
<h2 id="org4d271f4">코드</h2>
<div class="outline-text-2" id="text-org4d271f4">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;queue&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stack&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">pos</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">depth</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #ff6347;">MV</span> = 100000;
<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">visit</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">path</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;K);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;=100000;i++) path[i] = -1;

    q.push({N, 0});
    path[N] = N;
    visit[N] = <span style="color: #8ae234;">true</span>;

    <span style="color: #8ae234; font-weight: bold;">stack</span> &lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">sp</span>;
    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();

        <span style="color: #729fcf; font-weight: bold;">if</span> (cur.pos == K) {
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, cur.depth);

            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">pos</span> = cur.pos;
            <span style="color: #729fcf; font-weight: bold;">while</span>(pos != N) {
                sp.push(pos);
                pos = path[pos];
            }
            sp.push(pos);

            <span style="color: #729fcf; font-weight: bold;">while</span>(!sp.empty()) {
                <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val</span> = sp.top(); sp.pop();
                printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, val);
            }
            printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        }

        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">pos</span> = cur.pos;
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">depth</span> = cur.depth;

        <span style="color: #729fcf; font-weight: bold;">if</span> (pos + 1 &lt;= MV &amp;&amp; visit[pos+1] == <span style="color: #8ae234;">false</span>) {
            <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">next</span> = {pos + 1, depth + 1};
            path[pos + 1] = pos;
            visit[pos + 1] = <span style="color: #8ae234;">true</span>;
            q.push(next);
        }
        <span style="color: #729fcf; font-weight: bold;">if</span> (pos - 1 &gt;= 0 &amp;&amp; visit[pos-1] == <span style="color: #8ae234;">false</span>) {
            <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">next</span> = {pos - 1, depth + 1};
            path[pos - 1] = pos;
            visit[pos - 1] = <span style="color: #8ae234;">true</span>;
            q.push(next);
        }
        <span style="color: #729fcf; font-weight: bold;">if</span> (pos * 2 &lt;= MV &amp;&amp; visit[pos*2] == <span style="color: #8ae234;">false</span>) {
            <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">next</span> = {pos * 2, depth + 1};
            path[pos * 2] = pos;
            visit[pos * 2] = <span style="color: #8ae234;">true</span>;
            q.push(next);
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge70926e" class="outline-2">
<h2 id="orge70926e">문제 링크</h2>
<div class="outline-text-2" id="text-orge70926e">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/13913">https://www.acmicpc.net/problem/13913</a></li>
</ul>
</div>
</div>
